## Pre-processing of data on TEMPERATURE in Peru in 2006-2015

#### Dataset used:

The dataset which is used for the analysis is the World Bank's Climate Change Knowledge Portal historical data on monthly average temperature in Peru during 1991-2015, which can be accessed using the link:http://sdwebx.worldbank.org/climateportal/index.cfm?page=downscaled_data_download&menu=historical

**Step 1**: Importing neccessary package and loading the raw data file

In [8]:
import pandas as pd

TPdata="https://github.com/vzakhozhyi/599-A-Final-Project/raw/master/Data%20Original/Temp_Peru.xls"
TP=pd.read_excel(TPdata)

Checking the uploaded data. For that, we can use **shape** function. It is a dataframe with 6 variables (columns) and 300 observations (rows).

In [9]:
TP.shape

(300, 6)

Function **head()** shows first 5 rows (by default) of the dataframe. To change the number of rows visible, just indicate desired number in ().

In [10]:
TP.head()

       tas  \tYear   Month  Country   ISO3   ISO2
0  19.9068    1991       1      PER    NaN    NaN
1  20.1518    1991       2      PER    NaN    NaN
2  20.1453    1991       3      PER    NaN    NaN
3  20.0942    1991       4      PER    NaN    NaN
4  19.5744    1991       5      PER    NaN    NaN

**Step 2**: Cleaning the data

From the previous step, we see that the dataset contains some irrelevant variables with missing values. We need to clean the data set. For that, we drop columns we do not need for the analysis.

In [11]:
Tclean=TP.drop(columns=[' ISO3', ' ISO2'])

In [12]:
Tclean.shape

(300, 4)

Cleaning the dataset also includes changing names of the variables (columns). To check the current column names, use function **columns**:

In [13]:
Tclean.columns

Index(['tas', '\tYear', ' Month', ' Country'], dtype='object')

To change the old column names, first create the list of new names, then create the dictionary connection old names with new names using **comprehension**, **zip** function, and **rename** function.

In [14]:
Tnewnames=['temperature', 'year', 'month', 'country']
Tnew={old:new for old,new in zip(Tclean,Tnewnames)}
Tclean.rename(columns=Tnew,inplace=True)
Tclean.head()

   temperature  year  month country
0      19.9068  1991      1     PER
1      20.1518  1991      2     PER
2      20.1453  1991      3     PER
3      20.0942  1991      4     PER
4      19.5744  1991      5     PER

The "country" variable uses PER as the value for Peru. Changing "PER" to "Peru" (using **replace** function) is important for making datasets matching easier.

On this stage, we also subset the dataset to the timeframe of our interest 2006-2015.

In [15]:
Tclean['country']=Tclean['country'].replace(['PER'], 'Peru')

In [22]:
years=['2006','2007','2008','2009','2010','2011','2012','2013','2014','2015']
Tclean = Tclean[Tclean.year.isin(years)]
Tclean.head()

     temperature  year  month country
180      20.1541  2006      1    Peru
181      20.0151  2006      2    Peru
182      20.4858  2006      3    Peru
183      19.7383  2006      4    Peru
184      18.8578  2006      5    Peru

This step also includes an index reset to start at 0

In [19]:
Tclean.reset_index(drop=True).head()

   temperature  year  month country
0      20.1541  2006      1    Peru
1      20.0151  2006      2    Peru
2      20.4858  2006      3    Peru
3      19.7383  2006      4    Peru
4      18.8578  2006      5    Peru

**Step 3**: Creating a new file out of our cleaned data and saving it in

In [18]:
#Create a new file out of our cleaned data and we're done
Tclean.to_csv("PeruTemperatureFinal.csv",index=None)